import 'package:flutter/material.dart';


class AboutFeaPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Center(
          child: Text(
            'ຄະນະວິສະວະກຳສາດ',
            style: TextStyle(
              fontWeight: FontWeight.bold,
            ),
          ),
        ),
      ),
      body: ListView(
        children: <Widget>[
          CustomExpansionTile(
            title: '1. ພາກວິຊາວິສະວະກຳໂຍທາ',
            details: '      ພະແນກວິສະວະກໍາໂຍທາ (CED) ໄດ້ປະກອບສ່ວນສໍາຄັນເຂົ້າໃນອຸດສາຫະກໍາການກໍ່ສ້າງແລະໂດຍສະເພາະແມ່ນການກໍ່ສ້າງຂອງປະເທດໂດຍຜ່ານຫຼາຍໂຄງການກໍ່ສ້າງເສັ້ນທາງ, ຂົວ, ໂຮງງານຜະລິດ, ເຂື່ອນແລະອື່ນໆ … ວິສະວະກອນກໍ່ສ້າງຫຼາຍຄົນທີ່ເຮັດວຽກໃນໂຄງການເຫຼົ່ານັ້ນມີ. ຮຽນຈົບຈາກພະແນກນີ້.'
                'ຈຸດປະສົງຕົ້ນຕໍຂອງພະແນກວິສະວະກໍາໂຍທາແມ່ນເພື່ອສຶກສາວິສະວະກອນທີ່ຈະເຮັດວຽກຕົ້ນຕໍໃນພາກສະຫນາມຂອງການກໍ່ສ້າງ (ທີ່ຢູ່ອາໄສ, ອາຄານອຸດສາຫະກໍາ, ການກໍ່ສ້າງໃຫມ່ຫຼື / ແລະການປັບປຸງໃຫມ່ແລະວຽກງານສາທາລະນະ (ຖະຫນົນຫົນທາງແລະຂົວ).',
          ),
          Divider(),
          CustomExpansionTile(
            title: '2. ພາກວິຊາວິສະວະກຳຄອມພິວເຕີ ແລະ ເຕັກໂນໂລຊີຂໍ້ມູນຂ່າວສານ',
            details: '      ພະແນກວິສະວະກຳຄອມພິວເຕີ ແລະ ໄອທີ ມີຈຸດປະສົງເພື່ອຝຶກອົບຮົມນັກຮຽນ ແລະ ວິສະວະກອນທີ່ດີທີ່ສຸດເພື່ອຕອບສະໜອງຄວາມຕ້ອງການຂອງປະເທດໃນດ້ານວິສະວະກຳຄອມພິວເຕີ ແລະ ເຕັກໂນໂລຊີຂໍ້ມູນຂ່າວສານ. ນອກຈາກໜ້າທີ່ການສອນແລ້ວ, ກົມຍັງໄດ້ດຳເນີນການຄົ້ນຄ້ວາກ່ຽວກັບການປຸງແຕ່ງຂະໜານ, ລະບົບຂໍ້ມູນຂ່າວສານ, ການນຳໃຊ້ຈຸລະພາກ.'
                'ໂຄງການວິສະວະກໍາຄອມພິວເຕີເນັ້ນຫນັກໃສ່ການນໍາໃຊ້ຄອມພິວເຕີໃນລະບົບວິສະວະກໍາ, ແລະການໂຕ້ຕອບຂອງຄອມພິວເຕີກັບລະບົບທາງດ້ານຮ່າງກາຍ, ມັນມີຈຸດປະສົງສໍາລັບຜູ້ທີ່ກຽມພ້ອມທີ່ຈະເຂົ້າສູ່ອຸດສາຫະກໍາເຊັ່ນດຽວກັນກັບຜູ້ທີ່ຕ້ອງການຮຽນຈົບປະລິນຍາຕີດ້ານວິສະວະກໍາຄອມພິວເຕີ, ວິສະວະກໍາໄຟຟ້າ, ຊອບແວ.',
          ),
          Divider(),
          CustomExpansionTile(
            title: '3. ພາກວິຊາວິສະວະກຳເຄມີ',
            details: 'ກຳລັງອັບເດດຂໍ້ມູນ',
          ),
          Divider(),
          CustomExpansionTile(
            title: '4. ພາກວິຊາວິສະວະກຳໄຟຟ້າ',
            details: '      ຈຸດປະສົງຫຼັກຂອງພະແນກແມ່ນເພື່ອຝຶກອົບຮົມນັກຮຽນປະລິນຍາຕີແລະປະລິນຍາຕີໃຫ້ກາຍເປັນວິສະວະກອນທີ່ມີຄວາມຮູ້ຄວາມສາມາດສູງແລະທັກສະການປະຕິບັດທີ່ຊ່ວຍໃຫ້ພວກເຂົາແກ້ໄຂບັນຫາດ້ານວິຊາການ. ນັກສຶກສາທີ່ຈົບການສຶກສາໃນວິສະວະກໍາໄຟຟ້າແມ່ນຖືຕໍາແຫນ່ງທີ່ສໍາຄັນໃນຂະແຫນງອຸດສາຫະກໍາແລະການປະກອບສ່ວນເຂົ້າໃນການຫັນເປັນທີ່ທັນສະໄຫມຂອງປະເທດ.'
                'ນອກ​ຈາກ​ໜ້າ​ທີ່​ການ​ສອນ, ພະນັກງານ​ວິຊາ​ການ​ຍັງ​ດຳ​ເນີນ​ໂຄງການ​ຄົ້ນຄວ້າ​ຢ່າງ​ຕັ້ງໜ້າ​ໃນ​ຂົງ​ເຂດ​ຄວບ​ຄຸມ​ອັດ​ຕະ​ໂນ​ມັດ ​ແລະ ວິສະວະກຳ​ໄຟຟ້າ.ພະແນກວິສະວະກໍາໄຟຟ້າ (EED) ສະເຫນີໂຄງການລະດັບປະລິນຍາຕີດ້ານສິນເຊື່ອ 150 ສີ່ປີ. 2 ປີ​ເບື້ອງ​ຕົ້ນ​ໄດ້ຮັບ​ການ​ເປີດ​ເຜີຍ​ຢ່າງ​ກວ້າງ​ຂວາງ​ກັບ​ຂົງ​ເຂດ​ວິ​ສະ​ວະ​ກໍາ​ອື່ນໆ​ແລະ​ການ​ແນະ​ນໍາ​ວິ​ສະ​ວະ​ກໍາ​ໄຟ​ຟ້າ​. ໃນສອງປີສຸດທ້າຍ, ຫຼັກສູດໄດ້ສຸມໃສ່ວິຊາຫຼັກ, ເຊັ່ນ: ການວິເຄາະເຄືອຂ່າຍ, ວົງຈອນເອເລັກໂຕຣນິກແລະການອອກແບບ, ລະບົບເສັ້ນ, ເຄື່ອງຈັກສະລັບ – ປະຈຸບັນ, ທິດສະດີການສື່ສານ, ແລະອື່ນໆ. – ໂຄງການຄົ້ນຄວ້າສິນເຊື່ອຕ້ອງປະຕິບັດ.',
          ),
          Divider(),
          CustomExpansionTile(
            title: '5. ພາກວິຊາວິສະວະກຳເອເລັກໂຕນິກ ແລະ ຄົມມະນາຄົມ',
            details: '      ພະແນກກໍາລັງສະເຫນີ 2 ປະລິນຍາຕີລະດັບປະລິນຍາຕີ 4 ປີປະກອບດ້ວຍ 148 ສິນເຊື່ອສໍາລັບທັງໂຄງການ ENE ແລະໂຄງການ TCE. ສອງປີທໍາອິດຂອງໂຄງການທັງສອງແມ່ນປະກອບດ້ວຍວິທະຍາສາດພື້ນຖານແລະຫ້ອງຮຽນວິສະວະກໍາທີ່ມີຫ້ອງຮຽນແນະນໍາວິສະວະກໍາເອເລັກໂຕຣນິກເພີ່ມເຕີມ. ວິຊາຫຼັກແມ່ນສຸມໃສ່ໃນປີສຸດທ້າຍສອງປີ. ໃນປີ​ອາ​ວຸ​ໂສ​ຂອງ​ນັກ​ສຶກ​ສາ​, ໂຄງ​ການ​ຄົ້ນ​ຄວ້າ​ທີ່​ມີ​ມູນ​ຄ່າ 5 ຫນ່ວຍ​ກິດ​ແມ່ນ​ຕ້ອງ​ການ​ສໍາ​ລັບ​ໂຄງ​ການ​ທັງ​ສອງ​. ນັກສຶກສາຍັງຈໍາເປັນຕ້ອງໄດ້ດໍາເນີນການຝຶກອົບຮົມພາກປະຕິບັດເປັນຢ່າງຫນ້ອຍສີ່ອາທິດ.   ບັນດາໂຄງການເຫຼົ່ານີ້ໄດ້ຖືກອອກແບບແລະມີຈຸດປະສົງເພື່ອໃຫ້ນັກຮຽນສາມາດເຂົ້າມາພົບກັບສິ່ງທ້າທາຍພາຍໃນອຸດສາຫະກໍາທີ່ຕ້ອງການວິສະວະກອນ.',
          ),
          Divider(),
          CustomExpansionTile(
            title: '6. ພາກວິຊາວິສະວະກຳສິ່ງແວດລ້ອມ',
            details: '      ຈາກປີ 2008, EHD ຍັງສະຫນອງໂຄງການປະລິນຍາຕີໃຫມ່ສີ່ປີທີ່ນໍາໄປສູ່ລະດັບປະລິນຍາຕີຂອງວິສະວະກໍາສິ່ງແວດລ້ອມ. ເພື່ອ​ເຮັດ​ຕາມ​ຄວາມ​ຕ້ອງ​ການ​ຂອງ​ລະ​ດັບ​, ນັກ​ສຶກ​ສາ​ຈໍາ​ເປັນ​ຕ້ອງ​ສໍາ​ເລັດ 148 ຫຼັກ​ສູດ​ເຄຣ​ດິດ​. ເພື່ອໃຫ້ນັກຮຽນຈົບການສຶກສາດ້ານວິສະວະກໍາທີ່ມີຄວາມສົມດູນແລະສົມບູນແບບ, ການຝຶກອົບຮົມພາກບັງຄັບໃນສາຂາການບໍາບັດນ້ໍາແລະນ້ໍາເສຍ,ການບໍາບັດຂີ້ເຫຍື້ອແລະການຄຸ້ມຄອງສິ່ງເສດເຫຼືອອັນຕະລາຍແມ່ນຈໍາເປັນຕ້ອງໃຊ້ເວລາຢ່າງຫນ້ອຍສີ່ອາທິດໃນຕອນທ້າຍຂອງນັກສຶກສາປີທີສາມ.ໃນປີອາວຸໂສ,ນັກສຶກສາຈະຕ້ອງປະຕິບັດໂຄງການວິສະວະກໍາສິ່ງແວດລ້ອມສ່ວນບຸກຄົນ, ເຊິ່ງນັກສຶກສາແຕ່ລະຄົນຕ້ອງປະຕິບັດວຽກງານຄົ້ນຄ້ວາແລະກະກຽມບົດລາຍງານການຄົ້ນຄວ້າ.ໂຄງການວິສະວະກຳສິ່ງແວດລ້ອມແມ່ນເພື່ອໃຫ້ນັກສຶກສາມີຄວາມຮູ້ ແລະ ເຕັກໂນໂລຊີທາງດ້ານການປົກປັກຮັກສາສິ່ງແວດລ້ອມ, ການຄຸ້ມຄອງຊັບພະຍາກອນທຳມະຊາດ, ການຄຸ້ມຄອງສິ່ງແວດລ້ອມຕົວເມືອງ, ການຄວບຄຸມມົນລະພິດທາງອາກາດ, ການບຳບັດນ້ຳເສຍ ແລະ ການບຳບັດສິ່ງເສດເຫຼືອ.',
          ),
          Divider(),
          CustomExpansionTile(
            title: '7. ພາກວິຊາວິສະວະກຳກົນຈັກ',
            details: '      ພາກວິຊາວິສະວະກຳກົນຈັກ ສະເໜີໂຄງການຝຶກອົບຮົມທີ່ທັນສະໄໝ ແລະ ພາກປະຕິບັດ, ໃຫ້ນັກຮຽນມີຄວາມຮູ້ ແລະ ທັກສະທີ່ຈຳເປັນສຳລັບການເປັນຜູ້ນຳໃນອະນາຄົດໃນຂະແໜງການຂອງເຂົາເຈົ້າ. ພ້ອມ​ທັງ​ມີ​ໜ້າ​ທີ່​ປະຕິບັດ​ການ​ຄົ້ນຄວ້າ​ພື້ນຖານ ​ແລະ ນຳ​ໃຊ້​ເພື່ອ​ໜູນ​ຊ່ວຍ​ການ​ຫັນ​ເປັນ​ອຸດສາຫະກຳ ​ແລະ ທັນ​ສະ​ໄໝ​ຂອງ​ເສດຖະກິດ, ປະກອບສ່ວນ​ປະສິດທິ​ຜົນ​ໃຫ້​ແກ່​ການ​ພັດທະນາ​ເຕັກ​ໂນ​ໂລ​ຢີ. ຜົນໄດ້ຮັບຈາກກິດຈະກໍາການຄົ້ນຄວ້າແມ່ນພາດສະຕິກ, ພະລັງງານທົດແທນ, ແລະເຄື່ອງເຮັດຄວາມເຢັນ.'
                'ພະແນກດັ່ງກ່າວສະເຫນີໃຫ້ສອງລະດັບປະລິນຍາຕີລະດັບປະລິນຍາຕີສອງປີປະກອບດ້ວຍ 148 ສິນເຊື່ອສໍາລັບໂຄງການ ME ແລະ 147 ສິນເຊື່ອສໍາລັບ MIE. ສອງປີທໍາອິດຂອງໂຄງການ ME ແມ່ນປະກອບດ້ວຍຫ້ອງຮຽນວິທະຍາສາດພື້ນຖານແລະວິສະວະກໍາທີ່ມີສອງຫ້ອງຮຽນວິສະວະກໍາກົນຈັກແນະນໍາເພີ່ມເຕີມ. ສໍາລັບ MIE, ສອງປີທໍາອິດແມ່ນເກືອບຄືກັນກັບໂຄງການ ME, ຍົກເວັ້ນວິຊາການຄຸ້ມຄອງອຸດສາຫະກໍາທີ່ທັນສະໄຫມ. ວິຊາຫຼັກແມ່ນສຸມໃສ່ໃນປີສຸດທ້າຍສອງປີ. ສໍາລັບໂຄງການ MIE ແມ່ນປະກອບດ້ວຍວິຊາການຄຸ້ມຄອງອຸດສາຫະກໍາແລະການຜະລິດ,ໃນຂະນະທີ່ນັກສຶກສາ ME ໄດ້ຮຽນຮູ້ວິຊາກົນຈັກເພີ່ມເຕີມ. ໃນປີອາວຸໂສຂອງນັກຮຽນ, ໂຄງການຄົ້ນຄ້ວາທີ່ມີມູນຄ່າ 4 ໜ່ວຍກິດແມ່ນຕ້ອງການສໍາລັບໂຄງການ ME ແລະ MIE ຕາມລໍາດັບ. ນັກສຶກສາຍັງຈໍາເປັນຕ້ອງໄດ້ດໍາເນີນການຝຶກອົບຮົມພາກປະຕິບັດເປັນຢ່າງຫນ້ອຍສີ່ອາທິດ.',
          ),
          Divider(),
          CustomExpansionTile(
            title: '8. ພາກວິຊາວິສະວະກຳບໍ່ແຮ່',
            details: '      ນັບແຕ່ປີ 2008 ເປັນຕົ້ນມາ, ເພື່ອຕອບສະໜອງຄວາມຕ້ອງການສູງໃນຂະແໜງວິສະວະກຳບໍ່ແຮ່, ກົມວິສະວະກຳບໍ່ແຮ່ຍັງໄດ້ສະເໜີຫຼັກສູດປະລິນຍາຕີໃໝ່ 4 ປີ ໃຫ້ແກ່ລະດັບປະລິນຍາຕີດ້ານວິສະວະກຳບໍ່ແຮ່.ໂຄງການລະດັບປະລິນຍາຕີ 4 ປີນີ້ປະກອບດ້ວຍ 142 ໜ່ວຍກິດ. ສອງປີທໍາອິດແມ່ນປະກອບດ້ວຍວິທະຍາສາດພື້ນຖານແລະຫຼັກສູດວິສະວະກໍາພື້ນຖານ, ບວກກັບຫຼັກສູດການຂຸດຄົ້ນບໍ່ແຮ່ແນະນໍາ. ວິຊາຫຼັກແມ່ນສຸມໃສ່ໃນສອງປີສຸດທ້າຍ.'
                'ໂຄງການວິສະວະກໍາຂຸດຄົ້ນບໍ່ແຮ່ປະກອບດ້ວຍທໍລະນີສາດ, ແຮ່ທາດ, ເຕັກໂນໂລຊີຂຸດຄົ້ນບໍ່ແຮ່ແລະການອອກແບບບໍ່ແຮ່, ການລະເບີດ, ວິສະວະກໍາທໍລະນີສາດ, ການປຸງແຕ່ງແຮ່ທາດ, ໂລຫະສະກັດ, ເສດຖະສາດຂຸດຄົ້ນບໍ່ແຮ່ແລະການຄວບຄຸມແລະສິ່ງແວດລ້ອມ.',
          ),
          Divider(),
          CustomExpansionTile(
            title: '9. ພາກວິຊາວິສະວະກຳຂົວ-ທາງ',
            details: 'ກຳລັງອັບເດດຂໍ້ມູນ',
          ),
          Divider(),
          CustomExpansionTile(
            title: '10. ພາກວິຊາວິສະວະກຳຂົນສົ່ງ ແລະ ພາລະທິການ',
            details: 'ກຳລັງອັບເດດຂໍ້ມູນ',
          ),
        ],
      ),
    );
  }
}

class CustomExpansionTile extends StatelessWidget {
  final String title;
  final String details;

  CustomExpansionTile({required this.title, required this.details});

  @override
  Widget build(BuildContext context) {
    return ExpansionTile(
      title: Text(
        title,
        style: TextStyle(
          fontWeight: FontWeight.bold,
        ),
      ),
      children: <Widget>[
        Padding(
          padding: EdgeInsets.all(16.0),
          child: Text(details),
        ),
      ],
    );
  }
}